package stocking.data_impl;

import net.sf.json.JSONObject;
import org.junit.Before;
import org.junit.Test;
import stocking.data_service.BGraph_Data_Service;
import stocking.data_service.CodeName_Data_Service;
import stocking.data_service.DataFactory_Data_Service;
import stocking.po.StockInfoPO;

import java.text.SimpleDateFormat;

import static org.junit.Assert.*;

/**
 * Created by xjwhhh on 2017/6/5.
 */
public class CodeName_Data_ImplTest {
    DataFactory_Data_Service dataFactory_data_service;
    CodeName_Data_Service codeName_data_service;

    @Before
    public void init() throws Exception {
        dataFactory_data_service = DataFactory_Data_Impl.getInstance();
        codeName_data_service = dataFactory_data_service.codeName();
    }

    /**
     * 所有股票
     * @throws Exception
     */
    @Test
    public void get() throws Exception {
        StockInfoPO stockInfoPO = codeName_data_service.get();
        int size = stockInfoPO.getCode().length;
        assertEquals(3472, size);
    }

    /**
     * 行业，板块都不是全部
     * @throws Exception
     */
    @Test
    public void getPlate1() throws Exception{
        StockInfoPO stockInfoPO=codeName_data_service.getPlate("房地产开发与经营业/深市A股");
        JSONObject json = JSONObject.fromObject(stockInfoPO);//将java对象转换为json对象
        String str = json.toString();//将json对象转换为字符串
        String needStr="{\"code\":[\"000402\",\"000981\",\"000979\",\"000965\",\"000926\",\"000918\",\"000897\",\"000886\",\"000863\",\"000838\",\"000150\",\"000797\",\"000736\",\"000732\",\"000718\",\"000069\",\"000046\",\"000043\",\"000042\",\"000040\",\"000038\",\"000036\",\"000031\",\"000029\",\"000024\",\"000014\",\"000011\",\"000006\",\"000002\",\"000691\",\"000671\",\"000670\",\"000668\",\"000667\",\"000656\",\"000631\",\"000628\",\"000620\",\"000616\",\"000609\",\"000608\",\"000573\",\"000567\",\"000558\",\"000546\",\"000540\",\"000537\",\"000534\",\"000526\",\"000517\",\"000514\",\"000511\",\"000506\",\"000502\"],\"name\":[\"金融街\",\"银亿股份\",\"中弘股份\",\"天保基建\",\"福星股份\",\"嘉凯城\",\"津滨发展\",\"海南高速\",\"三湘印象\",\"财信发展\",\"宜华健康\",\"中国武夷\",\"中房地产\",\"泰禾集团\",\"苏宁环球\",\"华侨城A\",\"泛海控股\",\"中航地产\",\"中洲控股\",\"东旭蓝天\",\"深大通\",\"华联控股\",\"中粮地产\",\"深深房A\",\"招商地产\",\"沙河股份\",\"深物业A\",\"深振业A\",\"万科A\",\"ST亚太\",\"阳光城\",\"盈方微\",\"荣丰控股\",\"美好置业\",\"金科股份\",\"顺发恒业\",\"高新发展\",\"新华联\",\"海航投资\",\"绵石投资\",\"阳光股份\",\"粤宏远A\",\"海德股份\",\"莱茵体育\",\"金圆股份\",\"中天金融\",\"广宇发展\",\"万泽股份\",\"*ST紫学\",\"荣安地产\",\"渝开发\",\"*ST烯碳\",\"中润资源\",\"绿景控股\"]}";
        assertEquals(needStr, str);
    }

    /**
     * 板块不是全部
     * @throws Exception
     */
    @Test
    public void getPlate2() throws Exception{
        StockInfoPO stockInfoPO=codeName_data_service.getPlate("全部/深市B股");
        JSONObject json = JSONObject.fromObject(stockInfoPO);//将java对象转换为json对象
        String str = json.toString();//将json对象转换为字符串
        String needStr="{\"code\":[\"200488\",\"200468\",\"200429\",\"200418\",\"200413\",\"200992\",\"200986\",\"200869\",\"200168\",\"200160\",\"200152\",\"200771\",\"200770\",\"200761\",\"200726\",\"200725\",\"200706\",\"200058\",\"200057\",\"200056\",\"200055\",\"200054\",\"200053\",\"200045\",\"200041\",\"200039\",\"200037\",\"200030\",\"200029\",\"200028\",\"200026\",\"200025\",\"200024\",\"200022\",\"200020\",\"200019\",\"200018\",\"200017\",\"200016\",\"200015\",\"200013\",\"200012\",\"200011\",\"200003\",\"200002\",\"200625\",\"200613\",\"200596\",\"200581\",\"200570\",\"200553\",\"200550\",\"200541\",\"200539\",\"200530\",\"200521\",\"200513\",\"200512\",\"200505\"],\"name\":[\"晨鸣B\",\"*ST宁通B\",\"粤高速B\",\"小天鹅B\",\"东旭B\",\"中鲁B\",\"粤华包B\",\"张裕B\",\"舜喆B\",\"东沣B\",\"山航B\",\"杭汽轮B\",\"武锅B退\",\"本钢板B\",\"鲁泰B\",\"京东方B\",\"瓦轴B\",\"深赛格B\",\"*ST大洋B\",\"皇庭B\",\"方大B\",\"建摩B\",\"深基地B\",\"深纺织B\",\"*ST本实B\",\"中集B\",\"深南电B\",\"富奥B\",\"深深房B\",\"一致B\",\"飞亚达B\",\"特力B\",\"招商局B\",\"深赤湾B\",\"深华发B\",\"深深宝B\",\"神州B\",\"深中华B\",\"深康佳B\",\"PT中浩B\",\"*ST石化B\",\"南玻B\",\"深物业B\",\"PT金田B\",\"万科B\",\"长安B\",\"*ST东海B\",\"古井贡B\",\"苏威孚B\",\"苏常柴B\",\"沙隆达B\",\"江铃B\",\"粤照明B\",\"粤电力B\",\"大冷B\",\"皖美菱B\",\"丽珠B\",\"闽灿坤B\",\"*ST珠江B\"]}";
        assertEquals(needStr, str);
    }



    /**
     * 行业不是全部
     * @throws Exception
     */
    @Test
    public void getPlate3() throws Exception{
        StockInfoPO stockInfoPO=codeName_data_service.getPlate("房地产开发与经营业/全部");
        JSONObject json = JSONObject.fromObject(stockInfoPO);//将java对象转换为json对象
        String str = json.toString();//将json对象转换为字符串
        String needStr="{\"code\":[\"000402\",\"600565\",\"600533\",\"600510\",\"900950\",\"600503\",\"900940\",\"900932\",\"900911\",\"900902\",\"000981\",\"000979\",\"000965\",\"000926\",\"000918\",\"601588\",\"000897\",\"000886\",\"000863\",\"000838\",\"600393\",\"600383\",\"600376\",\"600340\",\"600325\",\"600322\",\"000150\",\"002305\",\"000797\",\"000736\",\"000732\",\"000718\",\"200168\",\"200160\",\"600266\",\"600246\",\"600240\",\"600239\",\"002244\",\"000069\",\"600225\",\"600223\",\"600215\",\"000046\",\"000043\",\"600208\",\"000042\",\"000040\",\"000038\",\"000036\",\"000031\",\"002208\",\"000029\",\"000024\",\"000014\",\"000011\",\"600890\",\"000006\",\"000002\",\"600862\",\"000691\",\"600840\",\"000671\",\"000670\",\"000668\",\"000667\",\"600823\",\"000656\",\"600807\",\"000631\",\"000628\",\"000620\",\"000616\",\"000609\",\"000608\",\"200029\",\"200024\",\"200011\",\"600185\",\"200002\",\"600173\",\"600162\",\"600159\",\"600158\",\"002146\",\"002133\",\"600113\",\"002113\",\"600791\",\"600773\",\"600767\",\"600766\",\"600759\",\"600748\",\"600745\",\"600743\",\"000573\",\"600736\",\"600734\",\"600733\",\"600732\",\"000567\",\"600724\",\"000558\",\"600716\",\"000546\",\"000540\",\"000537\",\"000534\",\"000526\",\"000517\",\"000514\",\"000511\",\"000506\",\"000502\",\"600094\",\"600077\",\"600067\",\"600064\",\"002077\",\"600053\",\"600052\",\"600048\",\"002016\",\"600696\",\"600684\",\"600683\",\"600675\",\"600665\",\"600663\",\"600658\",\"600657\",\"600649\",\"600647\",\"600641\",\"600639\",\"600638\",\"600621\",\"600615\",\"600604\"],\"name\":[\"金融街\",\"迪马股份\",\"栖霞建设\",\"黑牡丹\",\"新城B股\",\"华丽家族\",\"大名城B\",\"陆家B股\",\"金桥B股\",\"市北B股\",\"银亿股份\",\"中弘股份\",\"天保基建\",\"福星股份\",\"嘉凯城\",\"北辰实业\",\"津滨发展\",\"海南高速\",\"三湘印象\",\"财信发展\",\"粤泰股份\",\"金地集团\",\"首开股份\",\"华夏幸福\",\"华发股份\",\"天房发展\",\"宜华健康\",\"南国置业\",\"中国武夷\",\"中房地产\",\"泰禾集团\",\"苏宁环球\",\"舜喆B\",\"东沣B\",\"北京城建\",\"万通地产\",\"华业资本\",\"云南城投\",\"滨江集团\",\"华侨城A\",\"*ST松江\",\"鲁商置业\",\"长春经开\",\"泛海控股\",\"中航地产\",\"新湖中宝\",\"中洲控股\",\"东旭蓝天\",\"深大通\",\"华联控股\",\"中粮地产\",\"合肥城建\",\"深深房A\",\"招商地产\",\"沙河股份\",\"深物业A\",\"中房股份\",\"深振业A\",\"万科A\",\"中航高科\",\"ST亚太\",\"新湖创业\",\"阳光城\",\"盈方微\",\"荣丰控股\",\"美好置业\",\"世茂股份\",\"金科股份\",\"天业股份\",\"顺发恒业\",\"高新发展\",\"新华联\",\"海航投资\",\"绵石投资\",\"阳光股份\",\"深深房B\",\"招商局B\",\"深物业B\",\"格力地产\",\"万科B\",\"卧龙地产\",\"香江控股\",\"大龙地产\",\"中体产业\",\"荣盛发展\",\"广宇集团\",\"浙江东日\",\"天润数娱\",\"京能置业\",\"西藏城投\",\"*ST运盛\",\"园城黄金\",\"洲际油气\",\"上实发展\",\"中茵股份\",\"华远地产\",\"粤宏远A\",\"苏州高新\",\"实达集团\",\"S*ST前锋\",\"*ST新梅\",\"海德股份\",\"宁波富达\",\"莱茵体育\",\"凤凰股份\",\"金圆股份\",\"中天金融\",\"广宇发展\",\"万泽股份\",\"*ST紫学\",\"荣安地产\",\"渝开发\",\"*ST烯碳\",\"中润资源\",\"绿景控股\",\"大名城\",\"宋都股份\",\"冠城大通\",\"南京高科\",\"大港股份\",\"九鼎投资\",\"浙江广厦\",\"保利地产\",\"世荣兆业\",\"*ST匹凸\",\"珠江实业\",\"京投发展\",\"中华企业\",\"天地源\",\"陆家嘴\",\"电子城\",\"信达地产\",\"城投控股\",\"同达创业\",\"万业企业\",\"浦东金桥\",\"新黄浦\",\"华鑫股份\",\"丰华股份\",\"市北高新\"]}";
        assertEquals(needStr, str);
    }

    /**
     * 行业，板块都是全部
     * @throws Exception
     */
    @Test
    public void getPlate4() throws Exception {
        StockInfoPO stockInfoPO = codeName_data_service.getPlate("全部/全部");
        int size = stockInfoPO.getCode().length;
        assertEquals(3472, size);
    }
}